RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_enet_regs.h
/*
 * PS (RW)
 *
 * Port Select
 *  This bit selects the Ethernet line speed.
 * - 0: For 1000 Mbps operations
 * - 1: For 10 or 100 Mbps operations In 10 or 100 Mbps operations, this bit, along with FES bit, selects the exact line speed.
 * In the 10/100 Mbps-only (always 1) or 1000 Mbps-only (always 0) configurations, this bit is read-only with the appropriate value. In default 10/100/1000 Mbps configuration,
 * this bit is R_W. The mac_portselect_o or mac_speed_o[1] signal reflects the value of this bit.
 */
#define ENET_MACCFG_PS_MASK (0x8000U)
#define ENET_MACCFG_PS_SHIFT (15U)
#define ENET_MACCFG_PS_SET(x) (((uint32_t)(x) << ENET_MACCFG_PS_SHIFT) & ENET_MACCFG_PS_MASK)
#define ENET_MACCFG_PS_GET(x) (((uint32_t)(x) & ENET_MACCFG_PS_MASK) >> ENET_MACCFG_PS_SHIFT)

/*
 * FES (RW)
 *
 * Speed
 *  This bit selects the speed in the MII, RMII, SMII, RGMII, SGMII, or RevMII interface:
 * - 0: 10 Mbps
 * - 1: 100 Mbps This bit is reserved (RO) by default and is enabled only when the parameter SPEED_SELECT = Enabled.
 * This bit generates link speed encoding when Bit 24 (TC) is set in the RGMII, SMII, or SGMII mode.
 * This bit is always enabled for RGMII, SGMII, SMII, or RevMII interface.
 * In configurations with RGMII, SGMII, SMII, or RevMII interface, this bit is driven as an output signal (mac_speed_o[0]) to reflect the value of this bit in the mac_speed_o signal.
 * In configurations with RMII, MII, or GMII interface, you can optionally drive this bit as an output signal (mac_speed_o[0]) to reflect its value in the mac_speed_o signal.
 */
#define ENET_MACCFG_FES_MASK (0x4000U)
#define ENET_MACCFG_FES_SHIFT (14U)
#define ENET_MACCFG_FES_SET(x) (((uint32_t)(x) << ENET_MACCFG_FES_SHIFT) & ENET_MACCFG_FES_MASK)
#define ENET_MACCFG_FES_GET(x) (((uint32_t)(x) & ENET_MACCFG_FES_MASK) >> ENET_MACCFG_FES_SHIFT)

/*
 * DO (RW)
 *
 * Disable Receive Own
 *  When this bit is set, the MAC disables the reception of frames when the phy_txen_o is asserted in the half-duplex mode.
 * When this bit is reset, the MAC receives all packets that are given by the PHY while transmitting.
 * This bit is not applicable if the MAC is operating in the full-duplex mode. This bit is reserved (RO with default value) if the MAC is configured for the full-duplex-only operation.
 */
#define ENET_MACCFG_DO_MASK (0x2000U)
#define ENET_MACCFG_DO_SHIFT (13U)
#define ENET_MACCFG_DO_SET(x) (((uint32_t)(x) << ENET_MACCFG_DO_SHIFT) & ENET_MACCFG_DO_MASK)
#define ENET_MACCFG_DO_GET(x) (((uint32_t)(x) & ENET_MACCFG_DO_MASK) >> ENET_MACCFG_DO_SHIFT)

/*
 * LM (RW)
 *
 * Loopback Mode
 *  When this bit is set, the MAC operates in the loopback mode at GMII or MII.
 * The (G)MII Receive clock input (clk_rx_i) is required for the loopback to work properly, because the Transmit clock is not looped-back internally.
 */
#define ENET_MACCFG_LM_MASK (0x1000U)
#define ENET_MACCFG_LM_SHIFT (12U)
#define ENET_MACCFG_LM_SET(x) (((uint32_t)(x) << ENET_MACCFG_LM_SHIFT) & ENET_MACCFG_LM_MASK)
#define ENET_MACCFG_LM_GET(x) (((uint32_t)(x) & ENET_MACCFG_LM_MASK) >> ENET_MACCFG_LM_SHIFT)

/*
 * DM (RW)
 *
 * Duplex Mode
 *  When this bit is set, the MAC operates in the full-duplex mode where it can transmit and receive simultaneously.
 */
#define ENET_MACCFG_DM_MASK (0x800U)
#define ENET_MACCFG_DM_SHIFT (11U)
#define ENET_MACCFG_DM_SET(x) (((uint32_t)(x) << ENET_MACCFG_DM_SHIFT) & ENET_MACCFG_DM_MASK)
#define ENET_MACCFG_DM_GET(x) (((uint32_t)(x) & ENET_MACCFG_DM_MASK) >> ENET_MACCFG_DM_SHIFT)

/*
 * IPC (RW)
 *
 * Checksum Offload
 * When this bit is set, the MAC calculates the 16-bit one’s complement of the one’s complement sum of all received Ethernet frame payloads.
 * It also checks whether the IPv4 Header checksum (assumed to be bytes 25–26 or 29–30 (VLAN-tagged)
 * of the received Ethernet frame) is correct for the received frame and gives the status in the receive status word.
 * The MAC also appends the 16-bit checksum calculated for the IP header datagram payload (bytes after the IPv4 header)
 * and appends it to the Ethernet frame transferred to the application (when Type 2 COE is deselected).
 * When this bit is reset, this function is disabled.
 * When Type 2 COE is selected, this bit, when set, enables the IPv4 header checksum checking and IPv4 or IPv6 TCP, UDP, or ICMP payload checksum checking.
 */
#define ENET_MACCFG_IPC_MASK (0x400U)
#define ENET_MACCFG_IPC_SHIFT (10U)
#define ENET_MACCFG_IPC_SET(x) (((uint32_t)(x) << ENET_MACCFG_IPC_SHIFT) & ENET_MACCFG_IPC_MASK)
#define ENET_MACCFG_IPC_GET(x) (((uint32_t)(x) & ENET_MACCFG_IPC_MASK) >> ENET_MACCFG_IPC_SHIFT)

/*
 * DR (RW)
 *
 * Disable Retry
 * When this bit is set, the MAC attempts only one transmission.
 * When a collision occurs on the GMII or MII interface,
 * the MAC ignores the current frame transmission and reports a Frame Abort with excessive collision error in the transmit frame status.
 * When this bit is reset, the MAC attempts retries based on the settings of the BL field (Bits [6:5]).
 */
#define ENET_MACCFG_DR_MASK (0x200U)
#define ENET_MACCFG_DR_SHIFT (9U)
#define ENET_MACCFG_DR_SET(x) (((uint32_t)(x) << ENET_MACCFG_DR_SHIFT) & ENET_MACCFG_DR_MASK)
#define ENET_MACCFG_DR_GET(x) (((uint32_t)(x) & ENET_MACCFG_DR_MASK) >> ENET_MACCFG_DR_SHIFT)

/*
 * LUD (RW)
 *
 * Link Up or Down
 *  This bit indicates whether the link is up or down during the transmission of configuration in the RGMII, SGMII, or SMII interface:
 * - 0: Link Down
 * - 1: Link Up
 */
#define ENET_MACCFG_LUD_MASK (0x100U)
#define ENET_MACCFG_LUD_SHIFT (8U)
#define ENET_MACCFG_LUD_SET(x) (((uint32_t)(x) << ENET_MACCFG_LUD_SHIFT) & ENET_MACCFG_LUD_MASK)
#define ENET_MACCFG_LUD_GET(x) (((uint32_t)(x) & ENET_MACCFG_LUD_MASK) >> ENET_MACCFG_LUD_SHIFT)

/*
 * ACS (RW)
 *
 * Automatic Pad or CRC Stripping
 *  When this bit is set, the MAC strips the Pad or FCS field on the incoming frames only if the value of the length field is less than 1,536 bytes.
 * All received frames with length field greater than or equal to 1,536 bytes are passed to the application without stripping the Pad or FCS field.
 * When this bit is reset, the MAC passes all incoming frames, without modifying them, to the Host.
 */
#define ENET_MACCFG_ACS_MASK (0x80U)
#define ENET_MACCFG_ACS_SHIFT (7U)
#define ENET_MACCFG_ACS_SET(x) (((uint32_t)(x) << ENET_MACCFG_ACS_SHIFT) & ENET_MACCFG_ACS_MASK)
#define ENET_MACCFG_ACS_GET(x) (((uint32_t)(x) & ENET_MACCFG_ACS_MASK) >> ENET_MACCFG_ACS_SHIFT)

