RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_enet_regs.h
/*
 * HUC (RW)
 *
 * Hash Unicast
 *  When set, the MAC performs destination address filtering of unicast frames according to the hash table.
 * When reset, the MAC performs a perfect destination address filtering for unicast frames, that is, it compares the DA field with the values programmed in DA registers.
 */
#define ENET_MACFF_HUC_MASK (0x2U)
#define ENET_MACFF_HUC_SHIFT (1U)
#define ENET_MACFF_HUC_SET(x) (((uint32_t)(x) << ENET_MACFF_HUC_SHIFT) & ENET_MACFF_HUC_MASK)
#define ENET_MACFF_HUC_GET(x) (((uint32_t)(x) & ENET_MACFF_HUC_MASK) >> ENET_MACFF_HUC_SHIFT)

/*
 * PR (RW)
 *
 * Promiscuous Mode
 * When this bit is set, the Address Filter module passes all incoming frames irrespective of the destination or source address.
 *  The SA or DA Filter Fails status bits of the Receive Status Word are always cleared when PR is set.
 */
#define ENET_MACFF_PR_MASK (0x1U)
#define ENET_MACFF_PR_SHIFT (0U)
#define ENET_MACFF_PR_SET(x) (((uint32_t)(x) << ENET_MACFF_PR_SHIFT) & ENET_MACFF_PR_MASK)
#define ENET_MACFF_PR_GET(x) (((uint32_t)(x) & ENET_MACFF_PR_MASK) >> ENET_MACFF_PR_SHIFT)

/* Bitfield definition for register: HASH_H */
/*
 * HTH (RW)
 *
 * Hash Table High
 *  This field contains the upper 32 bits of the Hash table.
 */
#define ENET_HASH_H_HTH_MASK (0xFFFFFFFFUL)
#define ENET_HASH_H_HTH_SHIFT (0U)
#define ENET_HASH_H_HTH_SET(x) (((uint32_t)(x) << ENET_HASH_H_HTH_SHIFT) & ENET_HASH_H_HTH_MASK)
#define ENET_HASH_H_HTH_GET(x) (((uint32_t)(x) & ENET_HASH_H_HTH_MASK) >> ENET_HASH_H_HTH_SHIFT)

/* Bitfield definition for register: HASH_L */
/*
 * HTL (RW)
 *
 * Hash Table Low
 *  This field contains the lower 32 bits of the Hash table.
 */
#define ENET_HASH_L_HTL_MASK (0xFFFFFFFFUL)
#define ENET_HASH_L_HTL_SHIFT (0U)
#define ENET_HASH_L_HTL_SET(x) (((uint32_t)(x) << ENET_HASH_L_HTL_SHIFT) & ENET_HASH_L_HTL_MASK)
#define ENET_HASH_L_HTL_GET(x) (((uint32_t)(x) & ENET_HASH_L_HTL_MASK) >> ENET_HASH_L_HTL_SHIFT)

/* Bitfield definition for register: GMII_ADDR */
/*
 * PA (RW)
 *
 * Physical Layer Address
 *  This field indicates which of the 32 possible PHY devices are being accessed. For RevMII, this field gives the PHY Address of the RevMII module.
 */
#define ENET_GMII_ADDR_PA_MASK (0xF800U)
#define ENET_GMII_ADDR_PA_SHIFT (11U)
#define ENET_GMII_ADDR_PA_SET(x) (((uint32_t)(x) << ENET_GMII_ADDR_PA_SHIFT) & ENET_GMII_ADDR_PA_MASK)
#define ENET_GMII_ADDR_PA_GET(x) (((uint32_t)(x) & ENET_GMII_ADDR_PA_MASK) >> ENET_GMII_ADDR_PA_SHIFT)

/*
 * GR (RW)
 *
 * GMII Register
 *  These bits select the desired GMII register in the selected PHY device. For RevMII, these bits select the desired CSR register in the RevMII Registers set.
 */
#define ENET_GMII_ADDR_GR_MASK (0x7C0U)
#define ENET_GMII_ADDR_GR_SHIFT (6U)
#define ENET_GMII_ADDR_GR_SET(x) (((uint32_t)(x) << ENET_GMII_ADDR_GR_SHIFT) & ENET_GMII_ADDR_GR_MASK)
#define ENET_GMII_ADDR_GR_GET(x) (((uint32_t)(x) & ENET_GMII_ADDR_GR_MASK) >> ENET_GMII_ADDR_GR_SHIFT)

/*
 * CR (RW)
 *
 * CSR Clock Range
 *  The CSR Clock Range selection determines the frequency of the MDC clock according to the CSR clock frequency used in your design.
 * The CSR clock corresponding to different GMAC configurations is given in Table 9-2 on page 564.
 * The suggested range of CSR clock frequency applicable for each value (when Bit[5] = 0)
 * ensures that the MDC clock is approximately between the frequency range 1.0 MHz–2.5 MHz.
 * - 0000: The CSR clock frequency is 60–100 MHz and the MDC clock frequency is CSR clock/42.
 * - 0001: The CSR clock frequency is 100–150 MHz and the MDC clock frequency is CSR clock/62.
 * - 0010: The CSR clock frequency is 20–35 MHz and the MDC clock frequency is CSR clock/16.
 * - 0011: The CSR clock frequency is 35–60 MHz and the MDC clock frequency is CSR clock/26.
 * - 0100: The CSR clock frequency is 150–250 MHz and the MDC clock frequency is CSR clock/102.
 * - 0101: The CSR clock frequency is 250–300 MHz and the MDC clock is CSR clock/124.
 * - 0110, 0111: Reserved
 * When Bit 5 is set, you can achieve higher frequency of the MDC clock than the frequency limit of 2.5 MHz (specified in the IEEE Std 802.3) and program a clock divider of lower value.
 * For example,
 * when CSR clock is of 100 MHz frequency and you program these bits as 1010,
 * then the resultant MDC clock is of 12.5 MHz which is outside the limit of IEEE 802.3 specified range.
 * Program the following values only if the interfacing chips support faster MDC clocks.
 * - 1000: CSR clock/4
 * - 1001: CSR clock/6
 * - 1010: CSR clock/8
 * - 1011: CSR clock/10
 * - 1100: CSR clock/12
 * - 1101: CSR clock/14
 * - 1110: CSR clock/16
 * - 1111: CSR clock/18 These bits are not used for accessing RevMII. These bits are read-only if the RevMII interface is selected as single PHY interface.
 */
#define ENET_GMII_ADDR_CR_MASK (0x3CU)
#define ENET_GMII_ADDR_CR_SHIFT (2U)
#define ENET_GMII_ADDR_CR_SET(x) (((uint32_t)(x) << ENET_GMII_ADDR_CR_SHIFT) & ENET_GMII_ADDR_CR_MASK)
#define ENET_GMII_ADDR_CR_GET(x) (((uint32_t)(x) & ENET_GMII_ADDR_CR_MASK) >> ENET_GMII_ADDR_CR_SHIFT)

/*
 * GW (RW)
 *
 * GMII Write
 *  When set, this bit indicates to the PHY or RevMII that this is a Write operation using the GMII Data register. If this bit is not set,
 * it indicates that this is a Read operation, that is, placing the data in the GMII Data register.
 */
#define ENET_GMII_ADDR_GW_MASK (0x2U)
#define ENET_GMII_ADDR_GW_SHIFT (1U)
#define ENET_GMII_ADDR_GW_SET(x) (((uint32_t)(x) << ENET_GMII_ADDR_GW_SHIFT) & ENET_GMII_ADDR_GW_MASK)
#define ENET_GMII_ADDR_GW_GET(x) (((uint32_t)(x) & ENET_GMII_ADDR_GW_MASK) >> ENET_GMII_ADDR_GW_SHIFT)

/*
 * GB (RW)
 *
 * GMII Busy
 *  This bit should read logic 0 before writing to Register 4 and Register 5.
 * During a PHY or RevMII register access, the software sets this bit to 1’b1 to indicate that a Read or Write access is in progress.
 *  Register 5 is invalid until this bit is cleared by the MAC.
 * Therefore, Register 5 (GMII Data) should be kept valid until the MAC clears this bit during a PHY Write operation.
 * Similarly for a read operation, the contents of Register 5 are not valid until this bit is cleared.
 * The subsequent read or write operation should happen only after the previous operation is complete.
 * Because there is no acknowledgment from the PHY to MAC after a read or write operation is completed,
 * there is no change in the functionality of this bit even when the PHY is not present.
 */
#define ENET_GMII_ADDR_GB_MASK (0x1U)
#define ENET_GMII_ADDR_GB_SHIFT (0U)
#define ENET_GMII_ADDR_GB_SET(x) (((uint32_t)(x) << ENET_GMII_ADDR_GB_SHIFT) & ENET_GMII_ADDR_GB_MASK)
#define ENET_GMII_ADDR_GB_GET(x) (((uint32_t)(x) & ENET_GMII_ADDR_GB_MASK) >> ENET_GMII_ADDR_GB_SHIFT)

/* Bitfield definition for register: GMII_DATA */
/*
 * GD (RW)
 *
 * GMII Data
 *  This field contains the 16-bit data value read from the PHY or RevMII after a Management Read operation
 * or the 16-bit data value to be written to the PHY or RevMII before a Management Write operation.
 */
#define ENET_GMII_DATA_GD_MASK (0xFFFFU)
#define ENET_GMII_DATA_GD_SHIFT (0U)
#define ENET_GMII_DATA_GD_SET(x) (((uint32_t)(x) << ENET_GMII_DATA_GD_SHIFT) & ENET_GMII_DATA_GD_MASK)
#define ENET_GMII_DATA_GD_GET(x) (((uint32_t)(x) & ENET_GMII_DATA_GD_MASK) >> ENET_GMII_DATA_GD_SHIFT)

/* Bitfield definition for register: FLOWCTRL */
/*
 * PT (RW)
 *
 * Pause Time
 *  This field holds the value to be used in the Pause Time field in the transmit control frame.
 * If the Pause Time bits is configured to be double-synchronized to the (G)MII clock domain,
 *  then consecutive writes to this register should be performed only after at least four clock cycles in the destination clock domain.
 */
#define ENET_FLOWCTRL_PT_MASK (0xFFFF0000UL)
#define ENET_FLOWCTRL_PT_SHIFT (16U)
#define ENET_FLOWCTRL_PT_SET(x) (((uint32_t)(x) << ENET_FLOWCTRL_PT_SHIFT) & ENET_FLOWCTRL_PT_MASK)
#define ENET_FLOWCTRL_PT_GET(x) (((uint32_t)(x) & ENET_FLOWCTRL_PT_MASK) >> ENET_FLOWCTRL_PT_SHIFT)

