RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_enet_regs.h
/*
 * MGKPRCVD (RW)
 *
 * Magic Packet Received
 * When set, this bit indicates that the power management event is generated because of the reception of a magic packet. This bit is cleared by a Read into this register.
 */
#define ENET_PMT_CSR_MGKPRCVD_MASK (0x20U)
#define ENET_PMT_CSR_MGKPRCVD_SHIFT (5U)
#define ENET_PMT_CSR_MGKPRCVD_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_MGKPRCVD_SHIFT) & ENET_PMT_CSR_MGKPRCVD_MASK)
#define ENET_PMT_CSR_MGKPRCVD_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_MGKPRCVD_MASK) >> ENET_PMT_CSR_MGKPRCVD_SHIFT)

/*
 * RWKPKTEN (RW)
 *
 * Remote Wake-Up Frame Enable
 * When set, enables generation of a power management event because of remote wake-up frame reception.
 */
#define ENET_PMT_CSR_RWKPKTEN_MASK (0x4U)
#define ENET_PMT_CSR_RWKPKTEN_SHIFT (2U)
#define ENET_PMT_CSR_RWKPKTEN_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_RWKPKTEN_SHIFT) & ENET_PMT_CSR_RWKPKTEN_MASK)
#define ENET_PMT_CSR_RWKPKTEN_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_RWKPKTEN_MASK) >> ENET_PMT_CSR_RWKPKTEN_SHIFT)

/*
 * MGKPKTEN (RW)
 *
 * Magic Packet Enable
 * When set, enables generation of a power management event because of magic packet reception.
 */
#define ENET_PMT_CSR_MGKPKTEN_MASK (0x2U)
#define ENET_PMT_CSR_MGKPKTEN_SHIFT (1U)
#define ENET_PMT_CSR_MGKPKTEN_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_MGKPKTEN_SHIFT) & ENET_PMT_CSR_MGKPKTEN_MASK)
#define ENET_PMT_CSR_MGKPKTEN_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_MGKPKTEN_MASK) >> ENET_PMT_CSR_MGKPKTEN_SHIFT)

/*
 * PWRDWN (RW)
 *
 * Power Down
 * When set, the MAC receiver drops all received frames until it receives the expected magic packet or remote wake-up frame.
 * This bit is then self-cleared and the power-down mode is disabled.
 * The Software can also clear this bit before the expected magic packet or remote wake-up frame is received.
 * The frames, received by the MAC after this bit is cleared, are forwarded to the application.
 * This bit must only be set when the Magic Packet Enable, Global Unicast, or Remote Wake-Upr Fame Enable bit is set high.
 * Note: You can gate-off the CSR clock during the power-down mode.
 * However, when the CSR clock is gated-off, you cannot perform any read or write operations on this register. Therefore, the Software cannot clear this bit.
 */
#define ENET_PMT_CSR_PWRDWN_MASK (0x1U)
#define ENET_PMT_CSR_PWRDWN_SHIFT (0U)
#define ENET_PMT_CSR_PWRDWN_SET(x) (((uint32_t)(x) << ENET_PMT_CSR_PWRDWN_SHIFT) & ENET_PMT_CSR_PWRDWN_MASK)
#define ENET_PMT_CSR_PWRDWN_GET(x) (((uint32_t)(x) & ENET_PMT_CSR_PWRDWN_MASK) >> ENET_PMT_CSR_PWRDWN_SHIFT)

/* Bitfield definition for register: LPI_CSR */
/*
 * LPITXA (RW)
 *
 * LPI TX Automate
 * This bit controls the behavior of the MAC when it is entering or coming out of the LPI mode on the transmit side.
 * This bit is not functional in the GMAC-CORE configuration in which the Tx clock gating is done during the LPI mode. If the LPITXA and LPIEN bits are set to 1,
 * the MAC enters the LPI mode only after all outstanding frames (in the core) and pending frames (in the application interface) have been transmitted.
 * The MAC comes out of the LPI mode when the application sends any frame for transmission or the application issues a TX FIFO Flush command.
 *  In addition, the MAC automatically clears the LPIEN bit when it exits the LPI state.
 * If TX FIFO Flush is set in Bit 20 of Register 6 (Operation Mode Register),
 * when the MAC is in the LPI mode, the MAC exits the LPI mode.
 * When this bit is 0, the LPIEN bit directly controls behavior of the MAC when it is entering or coming out of the LPI mode.
 */
#define ENET_LPI_CSR_LPITXA_MASK (0x80000UL)
#define ENET_LPI_CSR_LPITXA_SHIFT (19U)
#define ENET_LPI_CSR_LPITXA_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_LPITXA_SHIFT) & ENET_LPI_CSR_LPITXA_MASK)
#define ENET_LPI_CSR_LPITXA_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_LPITXA_MASK) >> ENET_LPI_CSR_LPITXA_SHIFT)

/*
 * PLSEN (RW)
 *
 * PHY Link Status Enable
 * This bit enables the link status received on the RGMII, SGMII, or SMII receive paths to be used for activating the LPI LS TIMER.
 * When set, the MAC uses the link-status bits of Register 54 (SGMII/RGMII/SMII Control and Status Register) and Bit 17 (PLS) for the LPI LS Timer trigger.
 *  When cleared, the MAC ignores the link-status bits of Register 54 and takes only the PLS bit. This bit is RO and reserved if you have not selected the RGMII, SGMII, or SMII PHY interface.
 */
#define ENET_LPI_CSR_PLSEN_MASK (0x40000UL)
#define ENET_LPI_CSR_PLSEN_SHIFT (18U)
#define ENET_LPI_CSR_PLSEN_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_PLSEN_SHIFT) & ENET_LPI_CSR_PLSEN_MASK)
#define ENET_LPI_CSR_PLSEN_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_PLSEN_MASK) >> ENET_LPI_CSR_PLSEN_SHIFT)

/*
 * PLS (RW)
 *
 * PHY Link Status
 * This bit indicates the link status of the PHY. The MAC Transmitter asserts the LPI pattern only when the link status is up (okay) at least for the time indicated by the LPI LS TIMER.
 * When set, the link is considered to be okay (up) and when reset, the link is considered to be down.
 */
#define ENET_LPI_CSR_PLS_MASK (0x20000UL)
#define ENET_LPI_CSR_PLS_SHIFT (17U)
#define ENET_LPI_CSR_PLS_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_PLS_SHIFT) & ENET_LPI_CSR_PLS_MASK)
#define ENET_LPI_CSR_PLS_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_PLS_MASK) >> ENET_LPI_CSR_PLS_SHIFT)

/*
 * LPIEN (RW)
 *
 * LPI Enable
 * When set, this bit instructs the MAC Transmitter to enter the LPI state. When reset, this bit instructs the MAC to exit the LPI state and resume normal transmission.
 * This bit is cleared when the LPITXA bit is set and the MAC exits the LPI state because of the arrival of a new packet for transmission.
 */
#define ENET_LPI_CSR_LPIEN_MASK (0x10000UL)
#define ENET_LPI_CSR_LPIEN_SHIFT (16U)
#define ENET_LPI_CSR_LPIEN_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_LPIEN_SHIFT) & ENET_LPI_CSR_LPIEN_MASK)
#define ENET_LPI_CSR_LPIEN_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_LPIEN_MASK) >> ENET_LPI_CSR_LPIEN_SHIFT)

/*
 * RLPIST (RW)
 *
 * Receive LPI State
 * When set, this bit indicates that the MAC is receiving the LPI pattern on the GMII or MII interface.
 */
#define ENET_LPI_CSR_RLPIST_MASK (0x200U)
#define ENET_LPI_CSR_RLPIST_SHIFT (9U)
#define ENET_LPI_CSR_RLPIST_SET(x) (((uint32_t)(x) << ENET_LPI_CSR_RLPIST_SHIFT) & ENET_LPI_CSR_RLPIST_MASK)
#define ENET_LPI_CSR_RLPIST_GET(x) (((uint32_t)(x) & ENET_LPI_CSR_RLPIST_MASK) >> ENET_LPI_CSR_RLPIST_SHIFT)

