RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6700/ip/hpm_enet_regs.h
/*
 * ONEKBBE (RW)
 *
 * 1 KB Boundary Crossing Enable for the GMAC-AXI Master
 * When set, the GMAC-AXI master performs burst transfers that do not cross 1 KB boundary.
 * When reset, the GMAC-AXI master performs burst transfers that do not cross 4 KB boundary.
 */
#define ENET_DMA_AXI_MODE_ONEKBBE_MASK (0x2000U)
#define ENET_DMA_AXI_MODE_ONEKBBE_SHIFT (13U)
#define ENET_DMA_AXI_MODE_ONEKBBE_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_ONEKBBE_SHIFT) & ENET_DMA_AXI_MODE_ONEKBBE_MASK)
#define ENET_DMA_AXI_MODE_ONEKBBE_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_ONEKBBE_MASK) >> ENET_DMA_AXI_MODE_ONEKBBE_SHIFT)

/*
 * AXI_AAL (RW)
 *
 * Address-Aligned Beats
 * This bit is read-only bit and reflects the Bit 25 (AAL) of Register 0 (Bus Mode Register).
 * When this bit is set to 1, the GMAC-AXI performs address-aligned burst transfers on both read and write channels.
 */
#define ENET_DMA_AXI_MODE_AXI_AAL_MASK (0x1000U)
#define ENET_DMA_AXI_MODE_AXI_AAL_SHIFT (12U)
#define ENET_DMA_AXI_MODE_AXI_AAL_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_AXI_AAL_SHIFT) & ENET_DMA_AXI_MODE_AXI_AAL_MASK)
#define ENET_DMA_AXI_MODE_AXI_AAL_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_AXI_AAL_MASK) >> ENET_DMA_AXI_MODE_AXI_AAL_SHIFT)

/*
 * BLEN256 (RW)
 *
 * AXI Burst Length 256
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 256 on the AXI master interface.
 * This bit is present only when the configuration parameter AXI_BL is set to 256. Otherwise, this bit is reserved and is read-only (RO).
 */
#define ENET_DMA_AXI_MODE_BLEN256_MASK (0x80U)
#define ENET_DMA_AXI_MODE_BLEN256_SHIFT (7U)
#define ENET_DMA_AXI_MODE_BLEN256_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN256_SHIFT) & ENET_DMA_AXI_MODE_BLEN256_MASK)
#define ENET_DMA_AXI_MODE_BLEN256_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN256_MASK) >> ENET_DMA_AXI_MODE_BLEN256_SHIFT)

/*
 * BLEN128 (RW)
 *
 * AXI Burst Length 128
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 128 on the AXI master interface.
 * This bit is present only when the configuration parameter AXI_BL is set to 128 or more. Otherwise, this bit is reserved and is read-only (RO).
 */
#define ENET_DMA_AXI_MODE_BLEN128_MASK (0x40U)
#define ENET_DMA_AXI_MODE_BLEN128_SHIFT (6U)
#define ENET_DMA_AXI_MODE_BLEN128_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN128_SHIFT) & ENET_DMA_AXI_MODE_BLEN128_MASK)
#define ENET_DMA_AXI_MODE_BLEN128_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN128_MASK) >> ENET_DMA_AXI_MODE_BLEN128_SHIFT)

/*
 * BLEN64 (RW)
 *
 * AXI Burst Length 64
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 64 on the AXI master interface.
 * This bit is present only when the configuration parameter AXI_BL is set to 64 or more. Otherwise, this bit is reserved and is read-only (RO).
 */
#define ENET_DMA_AXI_MODE_BLEN64_MASK (0x20U)
#define ENET_DMA_AXI_MODE_BLEN64_SHIFT (5U)
#define ENET_DMA_AXI_MODE_BLEN64_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN64_SHIFT) & ENET_DMA_AXI_MODE_BLEN64_MASK)
#define ENET_DMA_AXI_MODE_BLEN64_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN64_MASK) >> ENET_DMA_AXI_MODE_BLEN64_SHIFT)

/*
 * BLEN32 (RW)
 *
 * AXI Burst Length 32
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 32 on the AXI master interface.
 * This bit is present only when the configuration parameter AXI_BL is set to 32 or more. Otherwise, this bit is reserved and is read-only (RO).
 */
#define ENET_DMA_AXI_MODE_BLEN32_MASK (0x10U)
#define ENET_DMA_AXI_MODE_BLEN32_SHIFT (4U)
#define ENET_DMA_AXI_MODE_BLEN32_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN32_SHIFT) & ENET_DMA_AXI_MODE_BLEN32_MASK)
#define ENET_DMA_AXI_MODE_BLEN32_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN32_MASK) >> ENET_DMA_AXI_MODE_BLEN32_SHIFT)

/*
 * BLEN16 (RW)
 *
 * AXI Burst Length 16
 * When this bit is set to 1 or UNDEF is set to 1, the GMAC-AXI is allowed to select a burst length of 16 on the AXI master interface.
 */
#define ENET_DMA_AXI_MODE_BLEN16_MASK (0x8U)
#define ENET_DMA_AXI_MODE_BLEN16_SHIFT (3U)
#define ENET_DMA_AXI_MODE_BLEN16_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN16_SHIFT) & ENET_DMA_AXI_MODE_BLEN16_MASK)
#define ENET_DMA_AXI_MODE_BLEN16_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN16_MASK) >> ENET_DMA_AXI_MODE_BLEN16_SHIFT)

/*
 * BLEN8 (RW)
 *
 * AXI Burst Length 8
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 8 on the AXI master interface.
 * Setting this bit has no effect when UNDEF is set to 1.
 */
#define ENET_DMA_AXI_MODE_BLEN8_MASK (0x4U)
#define ENET_DMA_AXI_MODE_BLEN8_SHIFT (2U)
#define ENET_DMA_AXI_MODE_BLEN8_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN8_SHIFT) & ENET_DMA_AXI_MODE_BLEN8_MASK)
#define ENET_DMA_AXI_MODE_BLEN8_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN8_MASK) >> ENET_DMA_AXI_MODE_BLEN8_SHIFT)

/*
 * BLEN4 (RW)
 *
 * AXI Burst Length 4
 * When this bit is set to 1, the GMAC-AXI is allowed to select a burst length of 4 on the AXI master interface.
 * Setting this bit has no effect when UNDEF is set to 1.
 */
#define ENET_DMA_AXI_MODE_BLEN4_MASK (0x2U)
#define ENET_DMA_AXI_MODE_BLEN4_SHIFT (1U)
#define ENET_DMA_AXI_MODE_BLEN4_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_BLEN4_SHIFT) & ENET_DMA_AXI_MODE_BLEN4_MASK)
#define ENET_DMA_AXI_MODE_BLEN4_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_BLEN4_MASK) >> ENET_DMA_AXI_MODE_BLEN4_SHIFT)

/*
 * UNDEF (RW)
 *
 * AXI Undefined Burst Length
 * This bit is read-only bit and indicates the complement (invert) value of Bit 16 (FB) in Register 0 (Bus Mode Register).
 * - When this bit is set to 1, the GMAC-AXI is allowed to perform any burst length equal to or below the maximum allowed burst length programmed in Bits[7:3].
 * - When this bit is set to 0, the GMAC-AXI is allowed to perform only fixed burst lengths as indicated by BLEN256, BLEN128, BLEN64, BLEN32, BLEN16, BLEN8, or BLEN4, or a burst length of 1.
 * If UNDEF is set and none of the BLEN bits is set, then GMAC-AXI is allowed to perform a burst length of 16.
 */
#define ENET_DMA_AXI_MODE_UNDEF_MASK (0x1U)
#define ENET_DMA_AXI_MODE_UNDEF_SHIFT (0U)
#define ENET_DMA_AXI_MODE_UNDEF_SET(x) (((uint32_t)(x) << ENET_DMA_AXI_MODE_UNDEF_SHIFT) & ENET_DMA_AXI_MODE_UNDEF_MASK)
#define ENET_DMA_AXI_MODE_UNDEF_GET(x) (((uint32_t)(x) & ENET_DMA_AXI_MODE_UNDEF_MASK) >> ENET_DMA_AXI_MODE_UNDEF_SHIFT)

/* Bitfield definition for register: DMA_BUS_STATUS */
/*
 * AXIRDSTS (RW)
 *
 * AXI Master Read Channel Status
 * When high, it indicates that AXI master's read channel is active and transferring data.
 */
#define ENET_DMA_BUS_STATUS_AXIRDSTS_MASK (0x2U)
#define ENET_DMA_BUS_STATUS_AXIRDSTS_SHIFT (1U)
#define ENET_DMA_BUS_STATUS_AXIRDSTS_SET(x) (((uint32_t)(x) << ENET_DMA_BUS_STATUS_AXIRDSTS_SHIFT) & ENET_DMA_BUS_STATUS_AXIRDSTS_MASK)
#define ENET_DMA_BUS_STATUS_AXIRDSTS_GET(x) (((uint32_t)(x) & ENET_DMA_BUS_STATUS_AXIRDSTS_MASK) >> ENET_DMA_BUS_STATUS_AXIRDSTS_SHIFT)

